import { Phrase } from "@/components/inline";
import Sp from "@/components/sp";
export default [
    {
        id: 23,
        name: "射華",
        organization: "1-1",
        locations: ["3F 3-8"],
        description: (
            <p>
                こんにちは。 1年1組です。
                私たちの店では射的と駄菓子の販売を行います。
                豪華な景品も多くあるので、是非来てください。
                射華で待っています。
            </p>
        ),
    },
    {
        id: 19,
        name: "HIROKI",
        organization: "1-2",
        locations: ["3F 3-3"],
        description: (
            <p>
                ドーナツ, パンケーキ, プリン...
                などなど美味しいお菓子やドリンクとともにメイドがお出迎えします!!
                メイドと一緒に写真も取れるよ！
            </p>
        ),
    },
    {
        id: 20,
        name: "びっくりゾンビー！",
        organization: "1-3",
        locations: ["3F 3-4"],
        description: (
            <p>
                いつも通りの日常に飽き飽きしている刺激が欲しいそこのあなた！
                ゾンビ達が集めてきた美味しい食べ物が置いてある「びっくりゾンビー！」で非日常を味わってみませんか？
            </p>
        ),
    },
    {
        id: 31,
        name: "コートジボワーラナイ",
        organization: "1-4",
        locations: ["3F ｺﾓﾝﾎｰﾙ"],
        description: (
            <p>
                二高に来た記念写真を是非コートジボワーラナイで!!
                三日月やマリオの土管で写真を撮れます!!
                また二高ジャージを着たり二高の名所を巡ったりして二高を満喫できます!!
            </p>
        ),
    },
    {
        id: 2,
        name: "武井屋",
        organization: "1-5",
        locations: ["1F 1-2"],
        description: (
            <p>
                1年2組にて、つり、くじ、ゲームなどで楽しめる縁日を開催しています！
                景品の駄菓子などをGETしよう☆武井屋でお待ちしています！
            </p>
        ),
    },
    {
        id: 3,
        name: "ハセガワオオシ",
        organization: "1-6",
        locations: ["1F 1-2"],
        description: (
            <p>
                1-6のクラスでは、日々頑張っている皆さんの困り事や症状に合わせた医薬品…ではなく、駄菓子を処方しています！
                みなさんぜひお立ち寄りください！ お待ちしております！
            </p>
        ),
    },
    {
        id: 22,
        name: "Big Inside café",
        organization: "1-7",
        locations: ["3F 3-7"],
        description: (
            <p>
                派手でお洒落なアメリカの雰囲気を楽しめるカフェです！
                アイスやパンケーキ、ジュースを提供します！
                まさかの入試予想問題の販売も!?是非お越し下さい！
            </p>
        ),
    },
    {
        id: 9,
        name: "茶処壹岐休め (息休)",
        organization: "1-8",
        locations: ["1F 1-8"],
        description: (
            <p>
                団子、どら焼き、金平糖…だけじゃない！ ？
                和服を着た可愛い店員さんがあなたを待っています♡一休みしたいときにぜひお越しください！
            </p>
        ),
    },
    {
        id: 6,
        name: "IQ80",
        organization: "2-1",
        locations: ["1F 1-6"],
        description: (
            <p>
                1980年、S市。
                惨殺された国語教師の謎と噂、歪んだ愛が交錯する_開かずの1-6にて。
                私ﾀﾞけの､￤繧ﾘ繧一繝oc?逕 <br />
                <small>※ホラー‧グロが苦手な方やお子様はご遠慮下さい</small>
            </p>
        ),
    },
    {
        id: 11,
        name: "Starry Night 22",
        organization: "2-2",
        locations: ["2F 2-2"],
        description: (
            <p>
                当店はエナジードリンクとソフトドリンクのプレミアムなセレクションを誇る専門店。
                お客様の舌も大興奮すること間違いない…皆様のご来店を心よりお待ちしております。
            </p>
        ),
    },
    {
        id: 28,
        name: "Golden Forest",
        organization: "2-3",
        locations: ["2F 社会科教室"],
        description: (
            <p>
                スナックや飲み物をはじめとして、カラオケ、占い、ダーツなど様々なオプションを用意しています！
                かわいいママもお出迎え♡ ぜひ来てね！
            </p>
        ),
    },
    {
        id: 21,
        name: (
            <>
                <ruby>
                    ？<rp>(</rp> <rt>クエスチョン</rt> <rp>)</rp>
                </ruby>
            </>
        ),
        plain_name: "？(クエスチョン)",
        organization: "2-4",
        locations: ["3F 3-6"],
        description: (
            <p>
                古きよき時代に作られたカフェ「クエスチョン」、そこには大量の宝箱がある。
                君たちは開けることが出来るだろうか。
                また、長い間開けられていない豪華な宝箱…。
            </p>
        ),
    },
    {
        id: 16,
        name: "ホーンテッドアパート",
        organization: "2-5",
        locations: ["2F 2-8"],
        description: (
            <p>
                怪事件が相次いで止まないあるアパートの375号室。
                次々と起こる怪奇現象、部屋の秘密を握る謎の女性？
                あなたはこの恐怖を耐えることができるか。
                ゴ入居ヲ待チシテオリマス
            </p>
        ),
    },
    {
        id: 4,
        name: "こりん星のユウコリン",
        organization: "2-6",
        locations: ["1F 1-3"],
        description: (
            <p>
                おかえりなさいませ、ご主人様、お嬢様♡
                コリン星から来たメイドたちがみなさまに愛をこめてお給仕します♡
                一緒にちぇきも撮っちゃお♡ せーの！ 萌え萌えきゅん♡
            </p>
        ),
    },
    {
        id: 15,
        name: "UNIVERSAL STUDIOSNIKO",
        organization: "2-7",
        locations: ["2F 2-7"],
        description: (
            <p>
                NO LIMIT！ 〜ぶっとべ！
                ここは超元気特区〜ユニバ風カーニバルゲームがついに二高初上陸?!みんなの【超元気】を見せてくれ！
                人生にはぶっ飛んだ1日が必要だ。
            </p>
        ),
    },
    {
        id: 14,
        name: (
            <p>
                <Phrase>ゴスロリ喫茶</Phrase>
                <Phrase>ミスティックムーン</Phrase>
            </p>
        ),
        organization: "2-8",
        locations: ["2F 2-6"],
        description: (
            <p>
                真夜中のティーパーティーにみなさんをご招待！
                おいしいお菓子にドリンクをご用意しています。
                ドキドキハラハラが止まらない、非日常的な体験をぜひお楽しみください。
            </p>
        ),
    },
    {
        id: 36,
        name: "ゆゆしきたこやき",
        organization: "3-1",
        locations: ["外テント内"],
        description: (
            <p>
                3-1といふ所あり。
                山中とかや領る所なれば、二高生、そのほかも「いざ給へ。 3-1に。
                蛸焼召させむ。
                」とて具しもて行きたるに、ゆゆしく美味なれば、皆昇り給ひぬ。
                いみじ。
            </p>
        ),
    },
    {
        id: 32,
        name: "いきなりクレープ",
        organization: "3-2",
        locations: ["外テント内"],
        description: (
            <p>
                2024年8月31日、9月1日、仙台二高に1号店をオープン。
                北陵祭でクレープを食べたい！
                そんな、生徒の想いから誕生したのが「いきなりクレープ」です。
            </p>
        ),
    },
    {
        id: 39,
        name: "たぐちこおり",
        organization: "3-3",
        locations: ["外テント内"],
        description: (
            <p>
                アイスを愛す田口佳織先生。 そんな先生にちなんだ店名。
                寒いギャグと冷たいかき氷で最高に涼しいひとときを。
                (ギャグのくだりは出店内容と一切の関係がない)
            </p>
        ),
    },
    {
        id: 38,
        name: "西清UFOUR",
        organization: "3-4",
        locations: ["外テント内"],
        description: (
            <p>
                お祭りで食べる焼きそば、とても美味しいですよね。
                人間誰しも美味しいものを食べているときは幸せを感じるでしょう。
                私たちの焼きそばはきっとみなさんを幸せな気持ちにさ
            </p>
        ),
    },
    {
        id: 34,
        name: "焼き鳥かさい",
        organization: "3-5",
        locations: ["外テント内"],
        description: (
            <p>
                ねぇねぇ、今年も二高の文化祭行くよな？ 楽しみだよな!! え？
                今回は焼き鳥があるのか!! 美味しく手軽に食べれるから最高だ!!
                しかもこんな値段で!! これはもう行くしかねぇな!!
            </p>
        ),
    },
    {
        id: 33,
        name: "唐揚げの原",
        organization: "3-6",
        locations: ["外テント内"],
        description: (
            <p>
                唐揚げの原へようこそ！
                ジューシー唐揚げとホクホクポテトにあなたの味神経は必ず反応するはずです！
                多種多様な唐ポテを頬張りましょう！ ！ (※よく噛んで食べましょう)
            </p>
        ),
    },
    {
        id: 35,
        name: (
            <p>
                <Phrase>転生したら</Phrase>
                <Phrase>ケバブだった件</Phrase>
            </p>
        ),
        organization: "3-7",
        locations: ["外テント内"],
        description: (
            <p>
                3-7ではトルコ名物のケバブ(風)サンドをご提供します。
                暑いときは冷たいもの？ 冗談じゃあない。
                暑いときこそスパイスの効いた肉を喰らって元気を出せ！ ！
            </p>
        ),
    },
    {
        id: 37,
        name: (
            <p>
                <Phrase>のんちゃんの</Phrase>
                <Phrase>水素結合かき氷</Phrase>
            </p>
        ),
        organization: "3-8",
        locations: ["外テント内"],
        description: (
            <p>
                最近暑いですねぇ。 ところでみなさん、”氷”足りてますか？
                氷の足りないみなさんのために、3年8組が絶対零度冷たさギンギンのかき氷を作ります。
                ぜひ来てください！
            </p>
        ),
    },
    {
        id: 29,
        name: "NIKO and ...",
        organization: "生徒会総務",
        locations: ["2F ｺﾓﾝﾎｰﾙ"],
        description: (
            <p>
                二高の受験頑張りたいな。 二高生ってもっとアピールしたいな。
                と思っているそこのあなた！ 生徒会総務がお届けする NIKO and ...
                で、二高オリジナルグッズを手に入れよう!!
            </p>
        ),
    },
    {
        id: 13,
        name: "BOOK & Cafe S2Q",
        organization: "クイズ研究愛好会",
        locations: ["2F 2-4"],
        description: (
            <p>
                問題。
                英語で「民族的な」という意味の単語と発音が同じである、北陵祭で飲料‧謎解き本を販売、部誌を配布、クイズのフリバを開催予定の二高クイズ研究愛好会の通称は何？
            </p>
        ),
    },
    {
        id: 40,
        name: "合気道演武会",
        organization: "合気道部",
        locations: ["1F 柔道場"],
        description: (
            <p>
                仙台二高合気道部へようこそ。
                ー合気道ーそれは古くから伝わる、相手の力を利用し相手を制する武術である。
                華麗な演武をとくとご覧あれ。 一F 柔道場にてお待ちしています。
            </p>
        ),
    },
    {
        id: 5,
        name: "應援團幹部",
        organization: "應援團",
        locations: ["1F 1-4"],
        description: (
            <p>
                オリジナルグッズの販売、学ラン試着体験、應援歌披露などを行います。
            </p>
        ),
    },
    {
        id: 8,
        name: "Donation Station",
        organization: "ボランティア愛好会",
        locations: ["1F 1-8"],
        description: (
            <p>
                ペットボトルキャップを利用したミニゲーム、豪華な景品を用意しています。
                ボランティア愛好会の活動を知ってもらうためにもぜひ足を運んで下さい！
                ！ ★アイス売ってます！
            </p>
        ),
    },
    {
        id: 0,
        name: "仙台二高同窓会",
        organization: "同窓会",
        locations: ["1F 1-1"],
        description: (
            <p>
                仙台二高同窓生の作品(絵画、写真など)の展示を行います。
                同窓会クッキーの販売も行います！
            </p>
        ),
    },
    {
        id: 12,
        name: "休憩所",
        organization: "将棋部",
        locations: ["2F 2-3"],
        description: (
            <p>
                休憩できます。
                北陵祭中に歩き疲れてどこかで休みたくなったり、食べ物を買ってどこかで食べたかったりする時にご利用ください。
                一応将棋盤があるのでよければ将棋もどうぞ。
            </p>
        ),
    },
    {
        id: 30,
        name: "音楽喫茶HATTARI",
        organization: "吹奏楽部",
        locations: ["3F 音楽室", "3F 自習室"],
        description: (
            <p>
                吹奏楽部による心地のよいアンサンブルに包まれながら、軽食＆ドリンクを楽しみませんか？
                様々なジャンルの曲とメニューで、全ての方がお楽しみいただけること間違いなし！
            </p>
        ),
    },
    {
        id: 10,
        name: "ヨドミバシカメラ",
        organization: "写真部",
        locations: ["2F 2-1"],
        description: (
            <p>
                広いな大きいな楽しいな〜♪フォトスポットの提供、写真の販売をします！
                應援團の写真も手に入るかも…。 お待ちしています！
            </p>
        ),
    },
    {
        id: 24,
        name: "雑貨屋秋桜",
        organization: "美術部",
        locations: ["1F 美術室"],
        description: (
            <p>
                美術部は、部員が作った雑貨の販売や絵画の展示などを行います。
                是非校舎西側一F のｺﾓﾝﾎｰﾙ奥の美術室まで足を運んでみてください。
            </p>
        ),
    },
    {
        id: 1,
        name: "声量飲料水",
        organization: "放送部",
        locations: ["1F 1-1"],
        description: (
            <p>
                豊富な種類の飲料を全て100円で売っています！
                放送部員の美声を聞くこともできるかも!?
            </p>
        ),
    },
    {
        id: 26,
        name: "ブツリブスイッチ",
        organization: "物理部",
        locations: ["1F ｺﾓﾝﾎｰﾙ"],
        description: (
            <p>
                某教育番組をオマージュした装置を展示‧実演します。
                ぜひ見に来てください。
            </p>
        ),
    },
    {
        id: 18,
        name: "日本棋院仙台二高支部",
        organization: "囲碁部",
        locations: ["3F 3-2"],
        description: (
            <p>
                囲碁部では、囲碁体験型イベントを行います。
                初心者、経験者問わず気軽に来てください。
                漫画立ち読み、飲食物販売もあるので是非。 目指せ、全国！
            </p>
        ),
    },
    {
        id: 41,
        name: "Rockin’ HOKURYO",
        organization: "軽音楽部",
        locations: ["北陵館"],
        description: (
            <p>
                20以上の個性的なバンドが常にライブしています！
                普段は見られないバンドを見られるかも？
                北陵館でお待ちしております！
            </p>
        ),
    },
    {
        id: 27,
        name: "なまものぶ",
        organization: "生物部",
        locations: ["理科棟生物実験室"],
        description: (
            <p>
                楽しいテラリウム製作体験や、部員が趣味で飼育している外国の珍しい生物の展示など、面白い企画をたくさんやってます！
                去年大好評だったDNAストラップも発売中！ ！
            </p>
        ),
    },
    {
        id: 17,
        name: "二高星座館",
        organization: "地学部",
        locations: ["ドーム", "3F 3-1"],
        description: (
            <p>
                毎年恒例のプラネタリウムの出店です。
                今年は、受付場所でポストカードの販売もおこないます！
                受付で整理券を配布するので、見たい方はぜひお早めに来てください！
            </p>
        ),
    },
    {
        id: 7,
        name: (
            <p>
                <Phrase>CaGaCuBOXeS</Phrase> <Sp />
                <Phrase>-かがくのはこづめ-</Phrase>
            </p>
        ),
        plain_name: "CaGaCuBOXeS -かがくのはこづめ-",
        organization: "化学部",
        locations: ["1F 1-7"],
        description: (
            <p>
                今年は「そうか、そうか、つまり化学部はそんな良い部なんだな」と思えるような、誰でもおっけーな派手でおもしろい実験(きっと安全)をします。
                「化学の箱」を開けよう！
            </p>
        ),
    },
    {
        id: 25,
        name: "十代目たい焼き幸房",
        organization: "書道部",
        locations: ["1F 書道室"],
        description: (
            <p>
                1F 書道で冷やしたい焼きと扇子を販売します。
                扇子には書いてほしい言葉を部員が書きます。
                数に限りがあるのでお早めにー！
                作品展示もあるので是非立ち寄って下さい!!
            </p>
        ),
    },
];
