import { Phrase } from "@/components/inline";
import Sp from "@/components/sp";

export default [
    {
        id: 23,
        name: "射華",
        organization: "1-1",
        locations: ["3階3-8教室"],
        description: (
            <p>
                こんにちは。 1年1組です。
                私たちの店では射的と駄菓⼦の販売を⾏います。
                豪華な景品も多くあるので、是⾮来てください。
                射華で待っています。
            </p>
        ),
    },
    {
        id: 19,
        name: "HIROKI",
        organization: "1-2",
        locations: ["3階3-3教室"],
        description: (
            <p>
                ドーナツ, パンケーキ, プリン...
                などなど美味しいお菓⼦やドリンクとともにメイドがお出迎えします!!
                メイドと⼀緒に写真も取れるよ！
            </p>
        ),
    },
    {
        id: 20,
        name: "びっくりゾンビー！",
        organization: "1-3",
        locations: ["3階3-4教室"],
        description: (
            <p>
                いつも通りの⽇常に飽き飽きしている刺激が欲しいそこのあなた！
                ゾンビ達が集めてきた美味しい⾷べ物が置いてある「びっくりゾンビー！」で⾮⽇常を味わってみませんか？
            </p>
        ),
    },
    {
        id: 31,
        name: "コートジボワーラナイ",
        organization: "1-4",
        locations: ["3階コモンホール"],
        description: (
            <p>
                ⼆⾼に来た記念写真を是⾮コートジボワーラナイで!!
                三⽇⽉やマリオの⼟管で写真を撮れます!!
                また⼆⾼ジャージを着たり⼆⾼の名所を巡ったりして⼆⾼を満喫できます!!
            </p>
        ),
    },
    {
        id: 2,
        name: "武井屋",
        organization: "1-5",
        locations: ["1階1-2教室"],
        description: (
            <p>
                1年2組教室にて、つり、くじ、ゲームなどで楽しめる縁⽇を開催しています！
                景品の駄菓⼦などをGETしよう☆武井屋でお待ちしています！
            </p>
        ),
    },
    {
        id: 3,
        name: "ハセガワオオシ",
        organization: "1-6",
        locations: ["1階1-2教室"],
        description: (
            <p>
                1-6のクラスでは、⽇々頑張っている皆さんの困り事や症状に合わせた医薬品…ではなく、駄菓⼦を処⽅しています！
                みなさんぜひお⽴ち寄りください！ お待ちしております！
            </p>
        ),
    },
    {
        id: 22,
        name: "Big Inside café",
        organization: "1-7",
        locations: ["3階3-7教室"],
        description: (
            <p>
                派⼿でお洒落なアメリカの雰囲気を楽しめるカフェです！
                アイスやパンケーキ、ジュースを提供します！
                まさかの⼊試予想問題の販売も!?是⾮お越し下さい！
            </p>
        ),
    },
    {
        id: 9,
        name: "茶処壹岐休め (息休)",
        organization: "1-8",
        locations: ["3階3-8教室"],
        description: (
            <p>
                団⼦、どら焼き、⾦平糖…だけじゃない！ ？
                和服を着た可愛い店員さんがあなたを待っています♡⼀休みしたいときにぜひお越しください！
            </p>
        ),
    },
    {
        id: 6,
        name: "IQ80",
        organization: "2-1",
        locations: ["1階1-6教室"],
        description: (
            <p>
                1980年、S市。
                惨殺された国語教師の謎と噂、歪んだ愛が交錯する_開かずの教室1-6にて。
                私ﾀﾞけの､￤繧ﾘ繧⼀繝oc?逕
                <br />
                <small>※ホラー‧グロが苦⼿な⽅やお⼦様はご遠慮下さい</small>
            </p>
        ),
    },
    {
        id: 11,
        name: "Starry Night 22",
        organization: "2-2",
        locations: ["2階2-2教室"],
        description: (
            <p>
                当店はエナジードリンクとソフトドリンクのプレミアムなセレクションを誇る専⾨店。
                お客様の⾆も⼤興奮すること間違いない…皆様のご来店を⼼よりお待ちしております。
            </p>
        ),
    },
    {
        id: 28,
        name: "Golden Forest",
        organization: "2-3",
        locations: ["2階社会科教室"],
        description: (
            <p>
                スナックや飲み物をはじめとして、カラオケ、占い、ダーツなど様々なオプションを⽤意しています！
                かわいいママもお出迎え♡ぜひ来てね！
            </p>
        ),
    },
    {
        id: 21,
        name: (
            <>
                <ruby>
                    ？<rp>(</rp>
                    <rt>クエスチョン</rt>
                    <rp>)</rp>
                </ruby>
            </>
        ),
        organization: "2-4",
        locations: ["3階3-6教室"],
        description: (
            <p>
                古きよき時代に作られたカフェ「クエスチョン」、そこには⼤量の宝箱がある。
                君たちは開けることが出来るだろうか。
                また、⻑い間開けられていない豪華な宝箱…。
            </p>
        ),
    },
    {
        id: 16,
        name: "ホーンテッドアパート",
        organization: "2-5",
        locations: ["2階2-8教室"],
        description: (
            <p>
                怪事件が相次いで⽌まないあるアパートの375号室。
                次々と起こる怪奇現象、部屋の秘密を握る謎の⼥性？
                あなたはこの恐怖を耐えることができるか。
                ゴ⼊居ヲ待チシテオリマス
            </p>
        ),
    },
    {
        id: 4,
        name: "こりん星のユウコリン",
        organization: "2-6",
        locations: ["1階1-3教室"],
        description: (
            <p>
                おかえりなさいませ、ご主⼈様、お嬢様♡コリン星から来たメイドたちがみなさまに愛をこめてお給仕します♡⼀緒にちぇきも撮っちゃお♡せーの！
                萌え萌えきゅん♡
            </p>
        ),
    },
    {
        id: 15,
        name: "UNIVERSAL STUDIOSNIKO",
        organization: "2-7",
        locations: ["2階2-7教室"],
        description: (
            <p>
                NO LIMIT！ 〜ぶっとべ！
                ここは超元気特区〜ユニバ⾵カーニバルゲームがついに⼆⾼初上陸?!みんなの【超元気】を⾒せてくれ！
                ⼈⽣にはぶっ⾶んだ1⽇が必要だ。
            </p>
        ),
    },
    {
        id: 14,
        name: "ゴスロリ喫茶ミスティックムーン",
        organization: "2-8",
        locations: ["2階2-6教室"],
        description: (
            <p>
                真夜中のティーパーティーにみなさんをご招待！
                おいしいお菓⼦にドリンクをご⽤意しています。
                ドキドキハラハラが⽌まらない、⾮⽇常的な体験をぜひお楽しみください。
            </p>
        ),
    },
    {
        id: 36,
        name: "ゆゆしきたこやき",
        organization: "3-1",
        locations: ["外テント内"],
        description: (
            <p>
                3-1といふ所あり。
                ⼭中とかや領る所なれば、⼆⾼⽣、そのほかも「いざ給へ。 3-1に。
                蛸焼召させむ。
                」とて具しもて⾏きたるに、ゆゆしく美味なれば、皆昇り給ひぬ。
                いみじ。
            </p>
        ),
    },
    {
        id: 32,
        name: "いきなりクレープ",
        organization: "3-2",
        locations: ["外テント内"],
        description: (
            <p>
                2024年8⽉31⽇、9⽉1⽇、仙台⼆⾼に1号店をオープン。
                北陵祭でクレープを⾷べたい！
                そんな、⽣徒の想いから誕⽣したのが「いきなりクレープ」です。
            </p>
        ),
    },
    {
        id: 39,
        name: "たぐちこおり",
        organization: "3-3",
        locations: ["外テント内"],
        description: (
            <p>
                アイスを愛す⽥⼝佳織先⽣。 そんな先⽣にちなんだ店名。
                寒いギャグと冷たいかき氷で最⾼に涼しいひとときを。
                (ギャグのくだりは出店内容と⼀切の関係がない)
            </p>
        ),
    },
    {
        id: 38,
        name: "⻄清UFOUR",
        organization: "3-4",
        locations: ["外テント内"],
        description: (
            <p>
                お祭りで⾷べる焼きそば、とても美味しいですよね。
                ⼈間誰しも美味しいものを⾷べているときは幸せを感じるでしょう。
                私たちの焼きそばはきっとみなさんを幸せな気持ちにさ
            </p>
        ),
    },
    {
        id: 34,
        name: "焼き⿃かさい",
        organization: "3-5",
        locations: ["外テント内"],
        description: (
            <p>
                ねぇねぇ、今年も⼆⾼の⽂化祭⾏くよな？ 楽しみだよな!! え？
                今回は焼き⿃があるのか!! 美味しく⼿軽に⾷べれるから最⾼だ!!
                しかもこんな値段で!! これはもう⾏くしかねぇな!!
            </p>
        ),
    },
    {
        id: 33,
        name: "唐揚げの原",
        organization: "3-6",
        locations: ["外テント内"],
        description: (
            <p>
                唐揚げの原へようこそ！
                ジューシー唐揚げとホクホクポテトにあなたの味神経は必ず反応するはずです！
                多種多様な唐ポテを頬張りましょう！ ！ (※よく噛んで⾷べましょう)
            </p>
        ),
    },
    {
        id: 35,
        name: "転⽣したらケバブだった件",
        organization: "3-7",
        locations: ["外テント内"],
        description: (
            <p>
                3-7ではトルコ名物のケバブ(⾵)サンドをご提供します。
                暑いときは冷たいもの？ 冗談じゃあない。
                暑いときこそスパイスの効いた⾁を喰らって元気を出せ！ ！
            </p>
        ),
    },
    {
        id: 37,
        name: "のんちゃんの⽔素結合かき氷",
        organization: "3-8",
        locations: ["外テント内"],
        description: (
            <p>
                最近暑いですねぇ。 ところでみなさん、”氷”⾜りてますか？
                氷の⾜りないみなさんのために、3年8組が絶対零度冷たさギンギンのかき氷を作ります。
                ぜひ来てください！
            </p>
        ),
    },
    {
        id: 29,
        name: "NIKO and ...",
        organization: "⽣徒会総務",
        locations: ["2階コモンホール"],
        description: (
            <p>
                ⼆⾼の受験頑張りたいな。 ⼆⾼⽣ってもっとアピールしたいな。
                と思っているそこのあなた！ ⽣徒会総務がお届けする NIKO and ...
                で、⼆⾼オリジナルグッズを⼿に⼊れよう!!
            </p>
        ),
    },
    {
        id: 13,
        name: "BOOK & Cafe S2Q",
        organization: "クイズ研究愛好会",
        locations: ["2階2-4教室"],
        description: (
            <p>
                問題。
                英語で「⺠族的な」という意味の単語と発⾳が同じである、北陵祭で飲料‧謎解き本を販売、部誌を配布、クイズのフリバを開催予定の⼆⾼クイズ研究愛好会の通称は何？
            </p>
        ),
    },
    {
        id: 40,
        name: "合気道演武会",
        organization: "合気道部",
        locations: ["1階柔道場"],
        description: (
            <p>
                仙台⼆⾼合気道部へようこそ。
                ー合気道ーそれは古くから伝わる、相⼿の⼒を利⽤し相⼿を制する武術である。
                華麗な演武をとくとご覧あれ。 ⼀階柔道場にてお待ちしています。
            </p>
        ),
    },
    {
        id: 5,
        name: "應援團幹部",
        organization: "應援團",
        locations: ["1階1-4教室"],
        description: (
            <p>
                オリジナルグッズの販売、学ラン試着体験、應援歌披露などを⾏います。
            </p>
        ),
    },
    {
        id: 8,
        name: "Donation Station",
        organization: "ボランティア愛好会",
        locations: ["1階1-8教室"],
        description: (
            <p>
                ペットボトルキャップを利⽤したミニゲーム、豪華な景品を⽤意しています。
                ボランティア愛好会の活動を知ってもらうためにもぜひ⾜を運んで下さい！
                ！ ★アイス売ってます！
            </p>
        ),
    },
    {
        id: 0,
        name: "仙台⼆⾼同窓会",
        organization: "同窓会",
        locations: ["1階1-1教室"],
        description: (
            <p>
                仙台⼆⾼同窓⽣の作品(絵画、写真など)の展⽰を⾏います。
                同窓会クッキーの販売も⾏います！
            </p>
        ),
    },
    {
        id: 12,
        name: "休憩所",
        organization: "将棋部",
        locations: ["2階2-3教室"],
        description: (
            <p>
                休憩できます。
                北陵祭中に歩き疲れてどこかで休みたくなったり、⾷べ物を買ってどこかで⾷べたかったりする時にご利⽤ください。
                ⼀応将棋盤があるのでよければ将棋もどうぞ。
            </p>
        ),
    },
    {
        id: 30,
        name: "⾳楽喫茶HATTARI",
        organization: "吹奏楽部",
        locations: ["3階⾳楽室", "3階自習室"],
        description: (
            <p>
                吹奏楽部による⼼地のよいアンサンブルに包まれながら、軽⾷＆ドリンクを楽しみませんか？
                様々なジャンルの曲とメニューで、全ての⽅がお楽しみいただけること間違いなし！
            </p>
        ),
    },
    {
        id: 10,
        name: "ヨドミバシカメラ",
        organization: "写真部",
        locations: ["2階2-1教室"],
        description: (
            <p>
                広いな⼤きいな楽しいな〜♪フォトスポットの提供、写真の販売をします！
                應援團の写真も⼿に⼊るかも…。 お待ちしています！
            </p>
        ),
    },
    {
        id: 24,
        name: "雑貨屋秋桜",
        organization: "美術部",
        locations: ["1階美術室"],
        description: (
            <p>
                美術部は、部員が作った雑貨の販売や絵画の展⽰などを⾏います。
                是⾮校舎⻄側⼀階のコモンホール奥の美術室まで⾜を運んでみてください。
            </p>
        ),
    },
    {
        id: 1,
        name: "声量飲料⽔",
        organization: "放送部",
        locations: ["1階1-1教室"],
        description: (
            <p>
                豊富な種類の飲料を全て100円で売っています！
                放送部員の美声を聞くこともできるかも!?
            </p>
        ),
    },
    {
        id: 26,
        name: "ブツリブスイッチ",
        organization: "物理部",
        locations: ["1階コモンホール"],
        description: (
            <p>
                某教育番組をオマージュした装置を展⽰‧実演します。
                ぜひ⾒に来てください。
            </p>
        ),
    },
    {
        id: 18,
        name: "⽇本棋院仙台⼆⾼⽀部",
        organization: "囲碁部",
        locations: ["3階3-2教室"],
        description: (
            <p>
                囲碁部では、囲碁体験型イベントを⾏います。
                初⼼者、経験者問わず気軽に来てください。
                漫画⽴ち読み、飲⾷物販売もあるので是⾮。 ⽬指せ、全国！
            </p>
        ),
    },
    {
        id: 41,
        name: "Rockin’ HOKURYO",
        organization: "軽⾳楽部",
        locations: ["北陵館"],
        description: (
            <p>
                20以上の個性的なバンドが常にライブしています！
                普段は⾒られないバンドを⾒られるかも？
                北陵館でお待ちしております！
            </p>
        ),
    },
    {
        id: 27,
        name: "なまものぶ",
        organization: "⽣物部",
        locations: ["理科棟⽣物実験室"],
        description: (
            <p>
                楽しいテラリウム製作体験や、部員が趣味で飼育している外国の珍しい⽣物の展⽰など、⾯⽩い企画をたくさんやってます！
                去年⼤好評だったDNAストラップも発売中！ ！
            </p>
        ),
    },
    {
        id: 17,
        name: "⼆⾼星座館",
        organization: "地学部",
        locations: ["ドーム", "3階3-1教室"],
        description: (
            <p>
                毎年恒例のプラネタリウムの出店です。
                今年は、受付場所でポストカードの販売もおこないます！
                受付で整理券を配布するので、⾒たい⽅はぜひお早めに来てください！
            </p>
        ),
    },
    {
        id: 7,
        name: (
            <p>
                <Phrase>CaGaCuBOXeS</Phrase>
                <Sp />
                <Phrase>-かがくのはこづめ-</Phrase>
            </p>
        ),
        organization: "化学部",
        locations: ["1階1-7教室"],
        description: (
            <p>
                今年は「そうか、そうか、つまり化学部はそんな良い部なんだな」と思えるような、誰でもおっけーな派⼿でおもしろい実験(きっと安全)をします。
                「化学の箱」を開けよう！
            </p>
        ),
    },
    {
        id: 25,
        name: "⼗代⽬たい焼き幸房",
        organization: "書道部",
        locations: ["1階書道室"],
        description: (
            <p>
                1階書道教室で冷やしたい焼きと扇⼦を販売します。
                扇⼦には書いてほしい⾔葉を部員が書きます。
                数に限りがあるのでお早めにー！
                作品展⽰もあるので是⾮⽴ち寄って下さい!!
            </p>
        ),
    },
];
